# Part 1

## 1

### a

In [2]:
x = 'great'
x[-2]

'a'

### b

In [10]:
li = [32, 3, 5, 8, 33, 7]

def second_smallest(li):
    li.sort()
    return li[1]

second_smallest(li)

5

### c

In [9]:
mylist = [1, 1, 5, 3, 3, 6, 11, 11]
list(set(mylist))

[1, 3, 5, 6, 11]

### d

In [25]:
x = 216

def cube_root(x):
    return round(x**(1./3.), 2)

cube_root(x)

6.0

## 2

In [29]:
a = [1, 2, [3, 4, 'hello']]
print(a)
a[-1][-1] = ['bye']
a

[1, 2, [3, 4, 'hello']]

[1, 2, [3, 4, ['bye']]]

## 3

In [95]:
dict = {'a':9, 'b':(2,3,1), 'c':['object0','object1','object2']}
dict['c'][0]

'object0'

## 4

In [100]:
def circle_area():
    r = input('Please enter the radius of the circle \n')
    try:
        r = float(r)
        area = 22/7*r*r
        return round(area, 2)
    except:
        print('Invalid input, please enter a number')
        return circle_area()

circle_area()

Please enter the radius of the circle
a
Invalid input, please enter a number
Please enter the radius of the circle
h563
Invalid input, please enter a number
Please enter the radius of the circle
5

78.57

## 5

In [52]:
x = [1, 2, 3, 4, 5]
y = [5, 6, 7, 8, 9]

def odd_nos(x, y):
    odd = []
    z = x+y
    z = set(z)
    for i in z:
        if (i%2 != 0):
            odd.append(i)
    return odd

odd_nos(x, y)

[1, 3, 5, 7, 9]

## 6

In [56]:
def print_nos():
    for i in range(1, 16):
        if (i%3 == 0) & (i%5 == 0):
            print('GREATLEARNING')
        elif (i%3 == 0):
            print('GREAT')
        elif (i%5 == 0):
            print('LEARNING')
        else:
            print(i)
            
print_nos()

1
2
GREAT
4
LEARNING
GREAT
7
8
GREAT
LEARNING
11
GREAT
13
14
GREATLEARNING

# Part 2

In [57]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

## 1

In [113]:
df = pd.read_csv('online_sales.csv')
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/10 8:26,3.39,17850.0,United Kingdom

In [114]:
df[90:95]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
90,536378,84997B,RED 3 PIECE RETROSPOT CUTLERY SET,12,12/1/10 9:37,3.75,14688.0,United Kingdom
91,536378,84997C,BLUE 3 PIECE POLKADOT CUTLERY SET,6,12/1/10 9:37,3.75,14688.0,United Kingdom
92,536378,21094,SET/6 RED SPOTTY PAPER PLATES,12,12/1/10 9:37,0.85,14688.0,United Kingdom
93,536378,20725,LUNCH BAG RED RETROSPOT,10,12/1/10 9:37,1.65,14688.0,United Kingdom
94,536378,21559,STRAWBERRY LUNCH BOX WITH CUTLERY,6,12/1/10 9:37,2.55,14688.0,United Kingdom

## 2

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240007 entries, 0 to 240006
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    240007 non-null  object
 1   StockCode    240007 non-null  object
 2   Description  239106 non-null  object
 3   Quantity     240007 non-null  int64
 4   InvoiceDate  240007 non-null  object
 5   UnitPrice    240007 non-null  float64
 6   CustomerID   172782 non-null  float64
 7   Country      240007 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 14.6+ MB

In [116]:
df.shape, df.dtypes

((240007, 8),
 InvoiceNo       object
 StockCode       object
 Description     object
 Quantity         int64
 InvoiceDate     object
 UnitPrice      float64
 CustomerID     float64
 Country         object
 dtype: object)

In [117]:
df.nunique()

InvoiceNo      12468
StockCode       3645
Description     3617
Quantity         477
InvoiceDate    11240
UnitPrice       1053
CustomerID      2974
Country           38
dtype: int64

- There are 2 lakh 40 thousand data points and 8 columns
- Invoice No., StockCode, Description and Country are categorical columns, InvoiceDate needs to be converted to datetime format while rest all columns are numerical
- High overview of the dataset: It contains data on details of different items purchased by different customers in different countries

## 3

In [118]:
# % null values in each column
round((df.isnull().sum()/df.shape[0])*100, 2)

InvoiceNo       0.00
StockCode       0.00
Description     0.38
Quantity        0.00
InvoiceDate     0.00
UnitPrice       0.00
CustomerID     28.01
Country         0.00
dtype: float64

In [119]:
df = df.dropna(subset=['CustomerID', 'Description'])
df.reset_index(drop=True, inplace=True)

In [120]:
df.shape

(172782, 8)

## 4

In [121]:
df.describe(include='O')

,InvoiceNo,StockCode,Description,InvoiceDate,Country
count,172782,172782,172782,172782,172782
unique,10436,3282,3374,9735,37
top,547063,85123A,WHITE HANGING HEART T-LIGHT HOLDER,5/22/11 13:01,United Kingdom
freq,294,1156,1156,299,153620

In [122]:
df.corr()

            Quantity  UnitPrice  CustomerID
Quantity    1.000000  -0.000977   -0.004618
UnitPrice  -0.000977   1.000000   -0.002707
CustomerID -0.004618  -0.002707    1.000000

## 5

In [123]:
print('Before dropping quantity < 0; No. of Rows:', df.shape[0])
df = df[df['Quantity'] >= 0]
df.reset_index(drop=True, inplace=True)
print('After dropping quantity < 0; No. of Rows:', df.shape[0])

Before dropping quantity < 0; No. of Rows: 172782
After dropping quantity < 0; No. of Rows: 168675

## 6

In [125]:
list(df['Country'].unique())

['United Kingdom',
 'France',
 'Australia',
 'Netherlands',
 'Germany',
 'Norway',
 'EIRE',
 'Switzerland',
 'Spain',
 'Poland',
 'Portugal',
 'Italy',
 'Belgium',
 'Lithuania',
 'Japan',
 'Iceland',
 'Channel Islands',
 'Denmark',
 'Cyprus',
 'Sweden',
 'Finland',
 'Austria',
 'Greece',
 'Singapore',
 'Lebanon',
 'United Arab Emirates',
 'Israel',
 'Saudi Arabia',
 'Czech Republic',
 'Canada',
 'Unspecified',
 'Brazil',
 'USA',
 'European Community',
 'Bahrain',
 'Malta',
 'Unit']

In [75]:
df['Country'].value_counts()

United Kingdom          150046
Germany                   3958
France                    3562
EIRE                      2650
Netherlands               1139
Spain                     1131
Belgium                    914
Switzerland                697
Australia                  630
Portugal                   610
Norway                     368
Channel Islands            363
Cyprus                     350
Finland                    307
Italy                      299
Japan                      230
Sweden                     195
Denmark                    184
Poland                     180
Austria                    124
Singapore                  113
Iceland                    102
Greece                      85
Unspecified                 72
Canada                      68
Lebanon                     45
Malta                       45
Lithuania                   35
Brazil                      32
European Community          31
United Arab Emirates        30
USA                         22
Bahrain                     17
Israel                      16
Czech Republic              15
Saudi Arabia                 9
Unit                         1
Name: Country, dtype: int64

In [76]:
# UK has highest no. of instances

## 7

In [77]:
df['sales'] = df['Quantity']*df['UnitPrice']
df['sales'] = df['sales'].round(2)
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,sales
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/10 8:26,3.39,17850.0,United Kingdom,20.34

## 8a

In [82]:
# size of sales
df.groupby(['Country'])['sales'].sum().reset_index().sort_values(by=['sales'], ascending=False).reset_index(drop=True).head()

          Country       sales
0  United Kingdom  3167696.67
1     Netherlands   125816.11
2         Germany   106223.19
3            EIRE   101406.06
4          France    89349.88

## 8b

In [83]:
# mean value of sales
df.groupby(['Country'])['sales'].mean().reset_index().sort_values(by=['sales'], ascending=False).reset_index(drop=True).head()

       Country       sales
0    Australia  126.677444
1  Netherlands  110.461905
2        Japan  100.181609
3    Singapore   90.819912
4       Sweden   86.532205

## 9

In [86]:
# top products of sales
df.groupby(['StockCode', 'Description'])['sales'].sum().reset_index().sort_values(by=['sales'], ascending=False).reset_index(drop=True).head()

  StockCode                         Description     sales
0     22423            REGENCY CAKESTAND 3 TIER  84734.20
1     23166      MEDIUM CERAMIC TOP STORAGE JAR  78499.90
2    85123A  WHITE HANGING HEART T-LIGHT HOLDER  58904.07
3     47566                       PARTY BUNTING  40513.85
4      POST                             POSTAGE  39983.72

## 10

In [87]:
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'], errors='coerce')

In [90]:
df[['StockCode', 'InvoiceDate', 'sales']].head(1)

  StockCode         InvoiceDate  sales
0    85123A 2010-12-01 08:26:00   15.3

In [91]:
df['month'] = df['InvoiceDate'].dt.month

In [93]:
df.groupby(['month'])['sales'].sum().reset_index().sort_values(by=['sales'], ascending=False).reset_index(drop=True).head(1)

   month      sales
0      5  678594.56

In [94]:
# May month has highest sales